# Задание 3
a = int(input("Введите целое число: "))
b = a<<2 
c = a>>1
d = a & 15
f = a | 3
print(f'Исходное число: {a} ({bin(a)}) \n Сдвиг влево на 2: {b} ({bin(b)}) \n Сдвиг вправо на 1: {c} ({bin(c)}) \n Побитовое И с 15: {d} (0b{(bin(d))[2:]}) \n Побитовое ИЛИ с 3: {f} (0b{(bin(f))[2:]})')
