# Задание 1
a = int(input("Введите число:"))
b = int(input("Введите второе число:"))
sum = a + b
difference = a - b
multiplication = a * b
division = a / b
print("Сумма: a+b =", sum, '\n', "Разность: a - b =", difference, '\n', "Произведение: a * b =", multiplication, '\n', "Частное: a / b =", division)
