#Задача 1
age1=21
Pi=3.14159
print("Моё имя Максим")
print("Мне", age1, "год")
print("Число Пи равно", Pi)
print(True, end=("\n\n"))

#Задача 2
color=input("Какой ваш любимый цвет?")
age2=int(input("Сколько лет вы занимаетесь програмированнием?"))
print("Какой ваш любимый цвет?")
print("Сколько лет вы занимаетесь програмированнием?")
print("Привет, я люблю", color, "цвет и программирую уже", age2, "лет!", end=("\n\n"))


#Задача 3
print("Сегодня", end=" ")
print("07" ,"15", "2024", sep="/")
print("Python", end="_")
print("is great", end=("\n\n"))

#Задача 4
word="Просто"
num1=3020
print("Скажите любое слово и любое целое число")
print("Тип переменной целого числа:", num1, type(num1))
print("Тип переменной слова:", word, type(word), end=("\n\n"))

#Задача 5
empty_stroka1=""
empty_stroka2=" "
num2=0
num3=-10
print("Результат преобразования empty_stroka1:", bool(empty_stroka1))
print("Результат преобразования empty_stroka2:", bool(empty_stroka2))
print("Результат преобразования num2:", bool(num2))
print("Результат преобразования num3:", bool(num3), end=("\n\n"))