# Задание 1
print("Диана Койвистойнен")
print(int(16))
print(float(3.14159))
print(True)

# Задание 2
print("Ваш любимый цвет:", input())
print("Опыт программирование, сколько лет:", input(int()))
print("Привет, я люблю", input(str()), "и программирую уже", input(int()), "лет!")

#Задание 3
print("2024", "07", "15", sep='/')
print("Python", "is great", sep=('_'))

#Задание 4
print(input(str()), input(int()), type("str"))

#Задание 5
print(bool(""))
print(bool(" "))
print(bool(0))
print(bool(-10))